BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega16HVA.PIC
        <edc:AdjustPoint edc:_addr="0x7F" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x80" edc:access="nnnnn--n" edc:cname="TCCR1A" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WGM10" edc:desc="Waveform Generation Mode" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ICS1" edc:desc="Input Capture Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES1" edc:desc="Input Capture Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC1" edc:desc="Input Capture Noise Canceler" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICEN1" edc:desc="Input Capture Mode Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCW1" edc:desc="Timer/Counter Width" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x81" edc:access="-----nnn" edc:cname="TCCR1B" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="Clock Select1 bis" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x82" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x84" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x86" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x88" edc:access="nnnnnnnn" edc:cname="OCR1A" edc:nzwidth="0x8" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x89" edc:access="nnnnnnnn" edc:cname="OCR1B" edc:nzwidth="0x8" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x8A" edc:offset="0x3E"/>
        <edc:SFRDef edc:_addr="0xC8" edc:access="n-----nn" edc:cname="ROCR" edc:nzwidth="0x8" ltx:memberofperipheral="VOLTAGE_REGULATOR">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ROCWIE" edc:desc="ROC Warning Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ROCWIF" edc:desc="ROC Warning Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="ROCS" edc:desc="ROC Status" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xC9" edc:offset="0x7"/>
        <edc:SFRDef edc:_addr="0xD0" edc:access="n-nnnnnn" edc:cname="BGCCR" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGCC" edc:desc="BG Calibration of PTAT Current Bits" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="BGD" edc:desc="Setting the BGD bit to one will disable the bandgap voltage reference. This bit must be cleared before enabling CC-ADC or V-ADC, and must remain unset while either ADC is enabled." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD1" edc:access="nnnnnnnn" edc:cname="BGCRR" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGCR" edc:desc="Bandgap calibration bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD2" edc:offset="0xE"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="nnnnnnnn" edc:cname="CADAC0" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE1" edc:access="nnnnnnnn" edc:cname="CADAC1" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE2" edc:access="nnnnnnnn" edc:cname="CADAC2" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="CADAC3" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE4" edc:access="nnnnnnnn" edc:cname="CADCSRA" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CADSE" edc:desc="When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADSI" edc:desc="The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined." edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CADAS" edc:desc="CC_ADC Accumulate Current Select Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CADUB" edc:desc="CC_ADC Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADEN" edc:desc="When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE5" edc:access="-nnn-nnn" edc:cname="CADCSRB" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CADICIF" edc:desc="CC-ADC Instantaneous Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADRCIF" edc:desc="CC-ADC Accumulate Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADACIF" edc:desc="CC-ADC Accumulate Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CADICIE" edc:desc="CAD Instantenous Current Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADRCIE" edc:desc="Regular Current Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADACIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
